99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap_draw.c
    radius = clamp_radius_u32(radius);
    rr = (uint64_t)radius * radius;
    if (!vertical_radius_range(cy, radius, buffer->height, &start_y, &end_y)) {
        return;
    }
    for (y = start_y; y <= end_y; ++y) {
        int64_t dy = (int64_t)y - cy;
        uint64_t dy2 = (uint64_t)(dy < 0 ? -dy : dy);
        uint32_t span;

        if (dy2 > radius) {
            continue;
        }
        span = isqrt_u64(rr - dy2 * dy2);
        fill_span_raw(buffer,
                      (int64_t)cx - span,
                      y,
                      (int64_t)cx + span,
                      color,
                      &dirty_x0,
                      &dirty_y0,
                      &dirty_x1,
                      &dirty_y1);
    }
    mark_dirty_if_touched(buffer, dirty_x0, dirty_y0, dirty_x1, dirty_y1);
}

void draw_line_raw(esp32_mquickjs_bitmap_t *buffer,
                   int x0,
                   int y0,
                   int x1,
                   int y1,
                   uint32_t color);

static void fill_ellipse_raw(esp32_mquickjs_bitmap_t *buffer,
                             int32_t cx,
                             int32_t cy,
                             uint32_t rx,
                             uint32_t ry,
                             uint32_t color)
{
    int dirty_x0 = buffer->width;
    int dirty_y0 = buffer->height;
    int dirty_x1 = -1;
    int dirty_y1 = -1;
    int start_y;
    int end_y;
    uint64_t rx2;
    uint64_t ry2;
    int y;

    rx = clamp_radius_u32(rx);
    ry = clamp_radius_u32(ry);
    if (rx == 0 && ry == 0) {
        set_pixel_raw(buffer, cx, cy, color);
        mark_dirty(buffer, cx, cy, 1, 1);
        return;
    }
    if (ry == 0) {
        fill_span_raw(buffer,
                      (int64_t)cx - rx,
                      cy,
                      (int64_t)cx + rx,
                      color,
                      &dirty_x0,
                      &dirty_y0,
                      &dirty_x1,
                      &dirty_y1);
        mark_dirty_if_touched(buffer, dirty_x0, dirty_y0, dirty_x1, dirty_y1);
        return;
    }
    if (rx == 0) {
        int y0;
        int y1;

        if (!vertical_radius_range(cy, ry, buffer->height, &y0, &y1)) {
            return;
        }
        fill_rect_raw(buffer, cx, y0, 1, y1 - y0 + 1, color, true);
        return;
    }

    rx2 = (uint64_t)rx * rx;
    ry2 = (uint64_t)ry * ry;
    if (!vertical_radius_range(cy, ry, buffer->height, &start_y, &end_y)) {
        return;
    }
    for (y = start_y; y <= end_y; ++y) {
        int64_t dy = (int64_t)y - cy;
        uint64_t dy_abs = (uint64_t)(dy < 0 ? -dy : dy);
        uint64_t remaining;
        uint32_t span;

        if (dy_abs > ry) {
            continue;
        }
        remaining = ry2 - dy_abs * dy_abs;
        span = isqrt_u64((rx2 * remaining) / ry2);
        fill_span_raw(buffer,
                      (int64_t)cx - span,
                      y,
                      (int64_t)cx + span,
                      color,
                      &dirty_x0,
                      &dirty_y0,
                      &dirty_x1,
                      &dirty_y1);
    }
    mark_dirty_if_touched(buffer, dirty_x0, dirty_y0, dirty_x1, dirty_y1);
}

static void draw_ellipse_raw(esp32_mquickjs_bitmap_t *buffer,
                             int32_t cx,
                             int32_t cy,
                             uint32_t rx,
                             uint32_t ry,
                             uint32_t color)
{
    int dirty_x0 = buffer->width;
    int dirty_y0 = buffer->height;
    int dirty_x1 = -1;
    int dirty_y1 = -1;
    int start_y;
    int end_y;
    int start_x;
    int end_x;
    uint64_t rx2;
    uint64_t ry2;
    int x;
    int y;

    rx = clamp_radius_u32(rx);
    ry = clamp_radius_u32(ry);
    if (rx == 0 && ry == 0) {
        set_pixel_dirty_raw(buffer, cx, cy, color, &dirty_x0, &dirty_y0, &dirty_x1, &dirty_y1);
        mark_dirty_if_touched(buffer, dirty_x0, dirty_y0, dirty_x1, dirty_y1);
        return;
    }
    if (ry == 0) {
        draw_line_raw(buffer, cx - (int32_t)rx, cy, cx + (int32_t)rx, cy, color);
        mark_dirty(buffer, cx - (int32_t)rx, cy, (int)rx * 2 + 1, 1);
        return;
    }
    if (rx == 0) {
        draw_line_raw(buffer, cx, cy - (int32_t)ry, cx, cy + (int32_t)ry, color);
        mark_dirty(buffer, cx, cy - (int32_t)ry, 1, (int)ry * 2 + 1);
        return;
    }

    rx2 = (uint64_t)rx * rx;
    ry2 = (uint64_t)ry * ry;
    if (!vertical_radius_range(cy, ry, buffer->height, &start_y, &end_y)) {
        return;
    }
    for (y = start_y; y <= end_y; ++y) {
        int64_t dy = (int64_t)y - cy;
        uint64_t dy_abs = (uint64_t)(dy < 0 ? -dy : dy);
        uint64_t remaining;
        uint32_t span;

        if (dy_abs > ry) {
            continue;
        }
        remaining = ry2 - dy_abs * dy_abs;
        span = isqrt_u64((rx2 * remaining) / ry2);
        set_pixel_dirty_raw(buffer, cx - (int32_t)span, y, color, &dirty_x0, &dirty_y0, &dirty_x1, &dirty_y1);
        set_pixel_dirty_raw(buffer, cx + (int32_t)span, y, color, &dirty_x0, &dirty_y0, &dirty_x1, &dirty_y1);
    }
    if (horizontal_radius_range(cx, rx, buffer->width, &start_x, &end_x)) {
        for (x = start_x; x <= end_x; ++x) {
            int64_t dx = (int64_t)x - cx;
            uint64_t dx_abs = (uint64_t)(dx < 0 ? -dx : dx);
            uint64_t remaining;
            uint32_t span;

            if (dx_abs > rx) {
                continue;
            }
            remaining = rx2 - dx_abs * dx_abs;
            span = isqrt_u64((ry2 * remaining) / rx2);
            set_pixel_dirty_raw(buffer, x, cy - (int32_t)span, color, &dirty_x0, &dirty_y0, &dirty_x1, &dirty_y1);
            set_pixel_dirty_raw(buffer, x, cy + (int32_t)span, color, &dirty_x0, &dirty_y0, &dirty_x1, &dirty_y1);
        }
    }
    mark_dirty_if_touched(buffer, dirty_x0, dirty_y0, dirty_x1, dirty_y1);
}

static int32_t round_double_to_i32(double value)
{
    return value >= 0 ? (int32_t)(value + 0.5) : (int32_t)(value - 0.5);
}

