99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap_draw.c
static void draw_cubic_bezier_raw(esp32_mquickjs_bitmap_t *buffer,
                                  int32_t x0,
                                  int32_t y0,
                                  int32_t c1x,
                                  int32_t c1y,
                                  int32_t c2x,
                                  int32_t c2y,
                                  int32_t x1,
                                  int32_t y1,
                                  uint32_t color,
                                  uint32_t segments)
{
    int prev_x = x0;
    int prev_y = y0;
    int min_x = x0;
    int min_y = y0;
    int max_x = x0;
    int max_y = y0;
    uint32_t i;

    for (i = 1; i <= segments; ++i) {
        double t = (double)i / (double)segments;
        double mt = 1.0 - t;
        double mt2 = mt * mt;
        double t2 = t * t;
        int x = round_double_to_i32(mt2 * mt * x0 + 3.0 * mt2 * t * c1x + 3.0 * mt * t2 * c2x + t2 * t * x1);
        int y = round_double_to_i32(mt2 * mt * y0 + 3.0 * mt2 * t * c1y + 3.0 * mt * t2 * c2y + t2 * t * y1);

        draw_line_raw(buffer, prev_x, prev_y, x, y, color);
        expand_line_bounds(prev_x, prev_y, x, y, &min_x, &min_y, &max_x, &max_y);
        prev_x = x;
        prev_y = y;
    }
    mark_dirty(buffer, min_x, min_y, max_x - min_x + 1, max_y - min_y + 1);
}

static int32_t ceil_fixed_16(int64_t value)
{
    if (value >= 0) {
        return (int32_t)((value + 65535) >> 16);
    }
    return (int32_t)(-((-value) >> 16));
}

static int32_t floor_fixed_16(int64_t value)
{
    if (value >= 0) {
        return (int32_t)(value >> 16);
    }
    return (int32_t)(-(((-value) + 65535) >> 16));
}

static void sort_fixed_intersections(int64_t *values, uint32_t count)
{
    uint32_t i;

    for (i = 1; i < count; ++i) {
        int64_t value = values[i];
        uint32_t j = i;

        while (j > 0 && values[j - 1] > value) {
            values[j] = values[j - 1];
            --j;
        }
        values[j] = value;
    }
}

static bool point_list_get_length(JSContext *ctx, JSValue points, const char *api_name, uint32_t *out_length)
{
    JSGCRef length_ref;
    JSValue *length_value;

    if (JS_GetClassID(ctx, points) < 0) {
        JS_ThrowTypeError(ctx, "%s expects a point array", api_name);
        return false;
    }
    length_value = JS_PushGCRef(ctx, &length_ref);
    *length_value = JS_GetPropertyStr(ctx, points, "length");
    if (JS_IsException(*length_value)) {
        JS_PopGCRef(ctx, &length_ref);
        return false;
    }
    if (!JS_IsNumber(ctx, *length_value) || !value_to_u32(ctx, *length_value, out_length)) {
        JS_PopGCRef(ctx, &length_ref);
        JS_ThrowTypeError(ctx, "%s expects a point array", api_name);
        return false;
    }
    JS_PopGCRef(ctx, &length_ref);
    return true;
}

static bool parse_point_list(JSContext *ctx,
                             JSValue points_value,
                             const char *api_name,
                             bitmap_point_t *stack_points,
                             uint32_t stack_capacity,
                             bitmap_point_t **out_points,
                             uint32_t *out_count,
                             bool *out_owned)
{
    JSGCRef points_ref;
    JSGCRef item_ref;
    JSGCRef property_ref;
    JSValue *rooted_points;
    JSValue *item;
    JSValue *property;
    bitmap_point_t *points = NULL;
    uint32_t length = 0;
    uint32_t count = 0;
    uint32_t i;
    bool flat = false;

    *out_points = NULL;
    *out_count = 0;
    *out_owned = false;
    rooted_points = JS_PushGCRef(ctx, &points_ref);
    *rooted_points = points_value;
    if (!point_list_get_length(ctx, *rooted_points, api_name, &length)) {
        JS_PopGCRef(ctx, &points_ref);
        return false;
    }
    if (length == 0) {
        *out_points = stack_points;
        JS_PopGCRef(ctx, &points_ref);
        return true;
    }

    item = JS_PushGCRef(ctx, &item_ref);
    property = JS_PushGCRef(ctx, &property_ref);
    *item = JS_GetPropertyUint32(ctx, *rooted_points, 0);
    if (JS_IsException(*item)) {
        goto fail_exception;
    }
    flat = JS_IsNumber(ctx, *item);
    if (flat) {
        if ((length & 1U) != 0) {
            JS_ThrowTypeError(ctx, "%s expects an even-length flat point array", api_name);
            goto fail;
        }
        count = length >> 1U;
    } else {
        count = length;
    }
    if (count == 0) {
        *out_points = stack_points;
        JS_PopGCRef(ctx, &property_ref);
        JS_PopGCRef(ctx, &item_ref);
        JS_PopGCRef(ctx, &points_ref);
        return true;
    }
    if (count <= stack_capacity) {
        points = stack_points;
    } else {
        if (count > SIZE_MAX / sizeof(*points)) {
            JS_ThrowOutOfMemory(ctx);
            goto fail;
        }
        points = esp32_mquickjs_memory_payload_alloc(
            (size_t)count * sizeof(*points), ESP32_MQUICKJS_MEMORY_EXTERNAL);
        if (points == NULL) {
            JS_ThrowOutOfMemory(ctx);
            goto fail;
        }
        *out_owned = true;
    }

    if (flat) {
        for (i = 0; i < count; ++i) {
            *item = JS_GetPropertyUint32(ctx, *rooted_points, i * 2U);
            if (JS_IsException(*item) || !value_to_i32(ctx, *item, &points[i].x)) {
                JS_ThrowTypeError(ctx, "%s expects numeric point coordinates", api_name);
                goto fail;
            }
            *item = JS_GetPropertyUint32(ctx, *rooted_points, i * 2U + 1U);
            if (JS_IsException(*item) || !value_to_i32(ctx, *item, &points[i].y)) {
                JS_ThrowTypeError(ctx, "%s expects numeric point coordinates", api_name);
                goto fail;
            }
        }
    } else {
        for (i = 0; i < count; ++i) {
            *item = JS_GetPropertyUint32(ctx, *rooted_points, i);
            if (JS_IsException(*item)) {
                goto fail_exception;
            }
            if (JS_GetClassID(ctx, *item) < 0) {
                JS_ThrowTypeError(ctx, "%s expects points shaped as [x, y] or { x, y }", api_name);
                goto fail;
            }

            *property = JS_GetPropertyStr(ctx, *item, "length");
            if (JS_IsException(*property)) {
                goto fail_exception;
            }
            if (JS_IsNumber(ctx, *property)) {
                *property = JS_GetPropertyUint32(ctx, *item, 0);
                if (JS_IsException(*property) || !value_to_i32(ctx, *property, &points[i].x)) {
                    JS_ThrowTypeError(ctx, "%s expects numeric point coordinates", api_name);
                    goto fail;
                }
                *property = JS_GetPropertyUint32(ctx, *item, 1);
                if (JS_IsException(*property) || !value_to_i32(ctx, *property, &points[i].y)) {
                    JS_ThrowTypeError(ctx, "%s expects numeric point coordinates", api_name);
                    goto fail;
                }
            } else {
                *property = JS_GetPropertyStr(ctx, *item, "x");
                if (JS_IsException(*property) || !value_to_i32(ctx, *property, &points[i].x)) {
                    JS_ThrowTypeError(ctx, "%s expects numeric point coordinates", api_name);
                    goto fail;
                }
                *property = JS_GetPropertyStr(ctx, *item, "y");
                if (JS_IsException(*property) || !value_to_i32(ctx, *property, &points[i].y)) {
                    JS_ThrowTypeError(ctx, "%s expects numeric point coordinates", api_name);
                    goto fail;
                }
            }
        }
    }

    *out_points = points;
    *out_count = count;
    JS_PopGCRef(ctx, &property_ref);
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &points_ref);
    return true;

fail_exception:
    if (!JS_IsException(*item) && !JS_IsException(*property)) {
        JS_ThrowInternalError(ctx, "%s failed while reading points", api_name);
    }
fail:
    if (*out_owned && points != NULL) {
        heap_caps_free(points);
    }
    *out_points = NULL;
    *out_count = 0;
    *out_owned = false;
    JS_PopGCRef(ctx, &property_ref);
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &points_ref);
    return false;
}

static bool fill_polygon_raw(esp32_mquickjs_bitmap_t *buffer,
                             const bitmap_point_t *points,
                             uint32_t count,
                             uint32_t color,
                             int64_t *stack_intersections,
                             uint32_t stack_capacity)
{
    int64_t *intersections = stack_intersections;
    bool owns_intersections = false;
    int32_t min_y;
    int32_t max_y;
    int start_y;
    int end_y;
    int dirty_x0 = buffer->width;
    int dirty_y0 = buffer->height;
    int dirty_x1 = -1;
    int dirty_y1 = -1;
    uint32_t i;
    int y;

    if (count < 3) {
        return true;
    }
    if (count > stack_capacity) {
        if (count > SIZE_MAX / sizeof(*intersections)) {
            return false;
        }
        intersections = esp32_mquickjs_memory_payload_alloc(
            (size_t)count * sizeof(*intersections),
            ESP32_MQUICKJS_MEMORY_EXTERNAL);
        if (intersections == NULL) {
            return false;
        }
        owns_intersections = true;
    }

