99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap_draw.c
    min_y = points[0].y;
    max_y = points[0].y;
    for (i = 1; i < count; ++i) {
        if (points[i].y < min_y) {
            min_y = points[i].y;
        }
        if (points[i].y > max_y) {
            max_y = points[i].y;
        }
    }
    if (max_y < 0 || min_y >= buffer->height) {
        if (owns_intersections) {
            heap_caps_free(intersections);
        }
        return true;
    }
    start_y = min_y < 0 ? 0 : (int)min_y;
    end_y = max_y >= buffer->height ? buffer->height - 1 : (int)max_y;

    for (y = start_y; y <= end_y; ++y) {
        int64_t scan_y2 = ((int64_t)y << 1) + 1;
        uint32_t intersections_count = 0;
        uint32_t edge;

        for (edge = 0; edge < count; ++edge) {
            uint32_t next = edge == count - 1 ? 0 : edge + 1;
            int64_t x1 = points[edge].x;
            int64_t y1 = points[edge].y;
            int64_t x2 = points[next].x;
            int64_t y2 = points[next].y;

            if (((y1 << 1) <= scan_y2 && (y2 << 1) > scan_y2) ||
                ((y2 << 1) <= scan_y2 && (y1 << 1) > scan_y2)) {
                int64_t dy = y2 - y1;
                int64_t numerator = (scan_y2 - (y1 << 1)) * (x2 - x1) * 65536;
                int64_t denominator = dy << 1;

                intersections[intersections_count++] = (x1 << 16) + (numerator / denominator);
            }
        }
        sort_fixed_intersections(intersections, intersections_count);
        for (i = 0; i + 1 < intersections_count; i += 2) {
            int x_start = ceil_fixed_16(intersections[i]);
            int x_end = floor_fixed_16(intersections[i + 1]);
            int clipped_x0;
            int clipped_x1;

            if (x_end < x_start || x_end < 0 || x_start >= buffer->width) {
                continue;
            }
            clipped_x0 = x_start < 0 ? 0 : x_start;
            clipped_x1 = x_end >= buffer->width ? buffer->width - 1 : x_end;
            fill_rect_raw(buffer, clipped_x0, y, clipped_x1 - clipped_x0 + 1, 1, color, false);
            if (clipped_x0 < dirty_x0) {
                dirty_x0 = clipped_x0;
            }
            if (y < dirty_y0) {
                dirty_y0 = y;
            }
            if (clipped_x1 > dirty_x1) {
                dirty_x1 = clipped_x1;
            }
            if (y > dirty_y1) {
                dirty_y1 = y;
            }
        }
    }

    if (dirty_x1 >= dirty_x0 && dirty_y1 >= dirty_y0) {
        mark_dirty(buffer, dirty_x0, dirty_y0, dirty_x1 - dirty_x0 + 1, dirty_y1 - dirty_y0 + 1);
    }
    if (owns_intersections) {
        heap_caps_free(intersections);
    }
    return true;
}

static void draw_polyline_raw(esp32_mquickjs_bitmap_t *buffer,
                              const bitmap_point_t *points,
                              uint32_t count,
                              bool closed,
                              uint32_t color)
{
    int min_x;
    int min_y;
    int max_x;
    int max_y;
    uint32_t i;

    if (count < 2) {
        return;
    }
    min_x = points[0].x;
    min_y = points[0].y;
    max_x = points[0].x;
    max_y = points[0].y;
    for (i = 1; i < count; ++i) {
        draw_line_raw(buffer, points[i - 1].x, points[i - 1].y, points[i].x, points[i].y, color);
        if (points[i].x < min_x) {
            min_x = points[i].x;
        }
        if (points[i].y < min_y) {
            min_y = points[i].y;
        }
        if (points[i].x > max_x) {
            max_x = points[i].x;
        }
        if (points[i].y > max_y) {
            max_y = points[i].y;
        }
    }
    if (closed && count > 2) {
        draw_line_raw(buffer, points[count - 1].x, points[count - 1].y, points[0].x, points[0].y, color);
    }
    mark_dirty(buffer, min_x, min_y, max_x - min_x + 1, max_y - min_y + 1);
}

static bool curve_segments_from_options(JSContext *ctx,
                                        JSValue options,
                                        uint32_t fallback,
                                        const char *api_name,
                                        uint32_t *out_segments)
{
    JSGCRef property_ref;
    JSValue *property;
    int32_t segments = (int32_t)fallback;

    if (JS_IsUndefined(options) || JS_IsNull(options)) {
        *out_segments = fallback;
        return true;
    }
    if (JS_GetClassID(ctx, options) < 0) {
        JS_ThrowTypeError(ctx, "%s options must be an object", api_name);
        return false;
    }
    property = JS_PushGCRef(ctx, &property_ref);
    *property = JS_GetPropertyStr(ctx, options, "segments");
    if (JS_IsException(*property)) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    if (!JS_IsUndefined(*property) && !JS_IsNull(*property) && !value_to_i32(ctx, *property, &segments)) {
        JS_PopGCRef(ctx, &property_ref);
        JS_ThrowTypeError(ctx, "%s option 'segments' expects an integer", api_name);
        return false;
    }
    JS_PopGCRef(ctx, &property_ref);
    if (segments < 2) {
        segments = 2;
    }
    if (segments > 128) {
        segments = 128;
    }
    *out_segments = (uint32_t)segments;
    return true;
}

JSValue js_bitmap_draw_circle(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t cx;
    int32_t cy;
    int32_t radius;
    uint32_t color;
    bool ok;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.drawCircle()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 3 || !value_to_i32(ctx, argv[0], &cx) || !value_to_i32(ctx, argv[1], &cy) ||
        !value_to_i32(ctx, argv[2], &radius)) {
        return JS_ThrowTypeError(ctx, "Bitmap.drawCircle(cx, cy, radius, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 4 ? argv[3] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "Bitmap.drawCircle(cx, cy, radius, color) expects a valid color");
    }
    draw_circle_raw(buffer, cx, cy, abs_i32_to_u32(radius), color);
    return *this_val;
}

JSValue js_bitmap_fill_circle(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t cx;
    int32_t cy;
    int32_t radius;
    uint32_t color;
    bool ok;

