99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap_draw.c
    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.fillCircle()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 3 || !value_to_i32(ctx, argv[0], &cx) || !value_to_i32(ctx, argv[1], &cy) ||
        !value_to_i32(ctx, argv[2], &radius)) {
        return JS_ThrowTypeError(ctx, "Bitmap.fillCircle(cx, cy, radius, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 4 ? argv[3] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "Bitmap.fillCircle(cx, cy, radius, color) expects a valid color");
    }
    fill_circle_raw(buffer, cx, cy, abs_i32_to_u32(radius), color);
    return *this_val;
}

JSValue js_bitmap_draw_ellipse(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t cx;
    int32_t cy;
    int32_t rx;
    int32_t ry;
    uint32_t color;
    bool ok;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.drawEllipse()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 4 || !value_to_i32(ctx, argv[0], &cx) || !value_to_i32(ctx, argv[1], &cy) ||
        !value_to_i32(ctx, argv[2], &rx) || !value_to_i32(ctx, argv[3], &ry)) {
        return JS_ThrowTypeError(ctx, "Bitmap.drawEllipse(cx, cy, rx, ry, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "Bitmap.drawEllipse(cx, cy, rx, ry, color) expects a valid color");
    }
    draw_ellipse_raw(buffer, cx, cy, abs_i32_to_u32(rx), abs_i32_to_u32(ry), color);
    return *this_val;
}

JSValue js_bitmap_fill_ellipse(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t cx;
    int32_t cy;
    int32_t rx;
    int32_t ry;
    uint32_t color;
    bool ok;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.fillEllipse()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 4 || !value_to_i32(ctx, argv[0], &cx) || !value_to_i32(ctx, argv[1], &cy) ||
        !value_to_i32(ctx, argv[2], &rx) || !value_to_i32(ctx, argv[3], &ry)) {
        return JS_ThrowTypeError(ctx, "Bitmap.fillEllipse(cx, cy, rx, ry, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "Bitmap.fillEllipse(cx, cy, rx, ry, color) expects a valid color");
    }
    fill_ellipse_raw(buffer, cx, cy, abs_i32_to_u32(rx), abs_i32_to_u32(ry), color);
    return *this_val;
}

JSValue js_bitmap_draw_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    uint32_t color;
    bool ok;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.drawRect()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!rect_from_args(ctx, argc, argv, &x, &y, &width, &height, "Bitmap.drawRect()")) {
        return JS_EXCEPTION;
    }
    if (width <= 0 || height <= 0) {
        return *this_val;
    }
    color = normalize_color(ctx, buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "Bitmap.drawRect(x, y, width, height, color) expects a valid color");
    }
    draw_rect_raw(buffer, x, y, width, height, color);
    return *this_val;
}

JSValue js_bitmap_draw_round_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    int32_t radius;
    uint32_t color;
    bool ok;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.drawRoundRect()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 5 || !value_to_i32(ctx, argv[0], &x) || !value_to_i32(ctx, argv[1], &y) ||
        !value_to_i32(ctx, argv[2], &width) || !value_to_i32(ctx, argv[3], &height) ||
        !value_to_i32(ctx, argv[4], &radius)) {
        return JS_ThrowTypeError(ctx,
                                 "Bitmap.drawRoundRect(x, y, width, height, radius, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 6 ? argv[5] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "Bitmap.drawRoundRect(x, y, width, height, radius, color) expects a valid color");
    }
    draw_round_rect_raw(buffer, x, y, width, height, abs_i32_to_u32(radius), color);
    return *this_val;
}

JSValue js_bitmap_fill_round_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    int32_t radius;
    uint32_t color;
    bool ok;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.fillRoundRect()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 5 || !value_to_i32(ctx, argv[0], &x) || !value_to_i32(ctx, argv[1], &y) ||
        !value_to_i32(ctx, argv[2], &width) || !value_to_i32(ctx, argv[3], &height) ||
        !value_to_i32(ctx, argv[4], &radius)) {
        return JS_ThrowTypeError(ctx,
                                 "Bitmap.fillRoundRect(x, y, width, height, radius, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 6 ? argv[5] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "Bitmap.fillRoundRect(x, y, width, height, radius, color) expects a valid color");
    }
    fill_round_rect_raw(buffer, x, y, width, height, abs_i32_to_u32(radius), color);
    return *this_val;
}

JSValue js_bitmap_draw_line(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t x0;
    int32_t y0;
    int32_t x1;
    int32_t y1;
    uint32_t color;
    bool ok;
    int min_x;
    int min_y;
    int max_x;
    int max_y;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.drawLine()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 4 || !value_to_i32(ctx, argv[0], &x0) || !value_to_i32(ctx, argv[1], &y0) ||
        !value_to_i32(ctx, argv[2], &x1) || !value_to_i32(ctx, argv[3], &y1)) {
        return JS_ThrowTypeError(ctx, "Bitmap.drawLine(x0, y0, x1, y1, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "Bitmap.drawLine(x0, y0, x1, y1, color) expects a valid color");
    }
    draw_line_raw(buffer, x0, y0, x1, y1, color);
    min_x = x0 < x1 ? x0 : x1;
    min_y = y0 < y1 ? y0 : y1;
    max_x = x0 > x1 ? x0 : x1;
    max_y = y0 > y1 ? y0 : y1;
    mark_dirty(buffer, min_x, min_y, max_x - min_x + 1, max_y - min_y + 1);
    return *this_val;
}

static JSValue draw_point_list(JSContext *ctx,
                               JSValue *this_val,
                               int argc,
                               JSValue *argv,
                               const char *api_name,
                               bool closed)
{
    esp32_mquickjs_bitmap_t *buffer;
    bitmap_point_t stack_points[BITMAP_STACK_POINTS];
    bitmap_point_t *points = NULL;
    uint32_t count = 0;
    uint32_t color;
    bool ok;
    bool owns_points = false;

    buffer = bitmap_from_value(ctx, *this_val, api_name);
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 1 || !parse_point_list(ctx,
                                      argv[0],
                                      api_name,
                                      stack_points,
                                      BITMAP_STACK_POINTS,
                                      &points,
                                      &count,
                                      &owns_points)) {
        return JS_EXCEPTION;
    }
    color = normalize_color(ctx, buffer->format, argc >= 2 ? argv[1] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        if (owns_points) {
            heap_caps_free(points);
        }
        return JS_ThrowTypeError(ctx, "%s expects a valid color", api_name);
    }
    draw_polyline_raw(buffer, points, count, closed, color);
    if (owns_points) {
        heap_caps_free(points);
    }
    return *this_val;
}

JSValue js_bitmap_draw_polyline(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    return draw_point_list(ctx, this_val, argc, argv, "Bitmap.drawPolyline(points, color)", false);
}

JSValue js_bitmap_draw_polygon(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    return draw_point_list(ctx, this_val, argc, argv, "Bitmap.drawPolygon(points, color)", true);
}

JSValue js_bitmap_fill_polygon(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    bitmap_point_t stack_points[BITMAP_STACK_POINTS];
    bitmap_point_t *points = NULL;
    int64_t stack_intersections[BITMAP_STACK_POINTS];
    uint32_t count = 0;
    uint32_t color;
    bool ok;
    bool owns_points = false;
    bool filled;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.fillPolygon()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 1 || !parse_point_list(ctx,
                                      argv[0],
                                      "Bitmap.fillPolygon(points, color)",
                                      stack_points,
                                      BITMAP_STACK_POINTS,
                                      &points,
                                      &count,
                                      &owns_points)) {
        return JS_EXCEPTION;
    }
    color = normalize_color(ctx, buffer->format, argc >= 2 ? argv[1] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        if (owns_points) {
            heap_caps_free(points);
        }
        return JS_ThrowTypeError(ctx, "Bitmap.fillPolygon(points, color) expects a valid color");
    }
    filled = fill_polygon_raw(buffer, points, count, color, stack_intersections, BITMAP_STACK_POINTS);
    if (owns_points) {
        heap_caps_free(points);
    }
    if (!filled) {
        return JS_ThrowOutOfMemory(ctx);
    }
    return *this_val;
}

JSValue js_bitmap_draw_triangle(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    bitmap_point_t points[3];
    uint32_t color;
    bool ok;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.drawTriangle()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 6 ||
        !value_to_i32(ctx, argv[0], &points[0].x) ||
        !value_to_i32(ctx, argv[1], &points[0].y) ||
        !value_to_i32(ctx, argv[2], &points[1].x) ||
        !value_to_i32(ctx, argv[3], &points[1].y) ||
        !value_to_i32(ctx, argv[4], &points[2].x) ||
        !value_to_i32(ctx, argv[5], &points[2].y)) {
        return JS_ThrowTypeError(ctx,
                                 "Bitmap.drawTriangle(x0, y0, x1, y1, x2, y2, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 7 ? argv[6] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx,
                                 "Bitmap.drawTriangle(x0, y0, x1, y1, x2, y2, color) expects a valid color");
    }
    draw_polyline_raw(buffer, points, 3, true, color);
    return *this_val;
}

