99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_bitmap_draw.c
JSValue js_bitmap_fill_triangle(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    bitmap_point_t points[3];
    int64_t intersections[3];
    uint32_t color;
    bool ok;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.fillTriangle()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 6 ||
        !value_to_i32(ctx, argv[0], &points[0].x) ||
        !value_to_i32(ctx, argv[1], &points[0].y) ||
        !value_to_i32(ctx, argv[2], &points[1].x) ||
        !value_to_i32(ctx, argv[3], &points[1].y) ||
        !value_to_i32(ctx, argv[4], &points[2].x) ||
        !value_to_i32(ctx, argv[5], &points[2].y)) {
        return JS_ThrowTypeError(ctx,
                                 "Bitmap.fillTriangle(x0, y0, x1, y1, x2, y2, color) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 7 ? argv[6] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx,
                                 "Bitmap.fillTriangle(x0, y0, x1, y1, x2, y2, color) expects a valid color");
    }
    if (!fill_polygon_raw(buffer, points, 3, color, intersections, 3)) {
        return JS_ThrowOutOfMemory(ctx);
    }
    return *this_val;
}

JSValue js_bitmap_draw_quadratic_bezier(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t x0;
    int32_t y0;
    int32_t cx;
    int32_t cy;
    int32_t x1;
    int32_t y1;
    uint32_t segments;
    uint32_t color;
    bool ok;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.drawQuadraticBezier()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 6 ||
        !value_to_i32(ctx, argv[0], &x0) ||
        !value_to_i32(ctx, argv[1], &y0) ||
        !value_to_i32(ctx, argv[2], &cx) ||
        !value_to_i32(ctx, argv[3], &cy) ||
        !value_to_i32(ctx, argv[4], &x1) ||
        !value_to_i32(ctx, argv[5], &y1)) {
        return JS_ThrowTypeError(ctx,
                                 "Bitmap.drawQuadraticBezier(x0, y0, cx, cy, x1, y1, color, options) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 7 ? argv[6] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx,
                                 "Bitmap.drawQuadraticBezier(x0, y0, cx, cy, x1, y1, color, options) expects a valid color");
    }
    if (!curve_segments_from_options(ctx,
                                     argc >= 8 ? argv[7] : JS_UNDEFINED,
                                     24,
                                     "Bitmap.drawQuadraticBezier()",
                                     &segments)) {
        return JS_EXCEPTION;
    }
    draw_quadratic_bezier_raw(buffer, x0, y0, cx, cy, x1, y1, color, segments);
    return *this_val;
}

JSValue js_bitmap_draw_cubic_bezier(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t x0;
    int32_t y0;
    int32_t c1x;
    int32_t c1y;
    int32_t c2x;
    int32_t c2y;
    int32_t x1;
    int32_t y1;
    uint32_t segments;
    uint32_t color;
    bool ok;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.drawCubicBezier()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 8 ||
        !value_to_i32(ctx, argv[0], &x0) ||
        !value_to_i32(ctx, argv[1], &y0) ||
        !value_to_i32(ctx, argv[2], &c1x) ||
        !value_to_i32(ctx, argv[3], &c1y) ||
        !value_to_i32(ctx, argv[4], &c2x) ||
        !value_to_i32(ctx, argv[5], &c2y) ||
        !value_to_i32(ctx, argv[6], &x1) ||
        !value_to_i32(ctx, argv[7], &y1)) {
        return JS_ThrowTypeError(ctx,
                                 "Bitmap.drawCubicBezier(x0, y0, c1x, c1y, c2x, c2y, x1, y1, color, options) expects integer coordinates");
    }
    color = normalize_color(ctx, buffer->format, argc >= 9 ? argv[8] : JS_UNDEFINED, buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx,
                                 "Bitmap.drawCubicBezier(x0, y0, c1x, c1y, c2x, c2y, x1, y1, color, options) expects a valid color");
    }
    if (!curve_segments_from_options(ctx,
                                     argc >= 10 ? argv[9] : JS_UNDEFINED,
                                     32,
                                     "Bitmap.drawCubicBezier()",
                                     &segments)) {
        return JS_EXCEPTION;
    }
    draw_cubic_bezier_raw(buffer, x0, y0, c1x, c1y, c2x, c2y, x1, y1, color, segments);
    return *this_val;
}

JSValue js_bitmap_draw_mask(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    int32_t x;
    int32_t y;
    uint32_t width = 0;
    uint32_t height = 0;
    JSGCRef pixels_ref;
    JSGCRef property_ref;
    JSValue *pixels;
    JSValue *property;
    uint32_t index = 0;
    uint32_t color;
    uint32_t background;
    bool ok;
    bool has_background = false;
    uint32_t row;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.drawMask()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 3 || !value_to_i32(ctx, argv[0], &x) || !value_to_i32(ctx, argv[1], &y) ||
        JS_GetClassID(ctx, argv[2]) < 0) {
        return JS_ThrowTypeError(ctx, "Bitmap.drawMask(x, y, bitmap, options?) expects a bitmap object");
    }
    pixels = JS_PushGCRef(ctx, &pixels_ref);
    property = JS_PushGCRef(ctx, &property_ref);
    *pixels = JS_UNDEFINED;
    *property = JS_GetPropertyStr(ctx, argv[2], "width");
    if (JS_IsException(*property) || !value_to_u32(ctx, *property, &width)) {
        JS_PopGCRef(ctx, &property_ref);
        JS_PopGCRef(ctx, &pixels_ref);
        return JS_ThrowTypeError(ctx, "Bitmap.drawMask() bitmap.width must be numeric");
    }
    *property = JS_GetPropertyStr(ctx, argv[2], "height");
    if (JS_IsException(*property) || !value_to_u32(ctx, *property, &height)) {
        JS_PopGCRef(ctx, &property_ref);
        JS_PopGCRef(ctx, &pixels_ref);
        return JS_ThrowTypeError(ctx, "Bitmap.drawMask() bitmap.height must be numeric");
    }
    *pixels = JS_GetPropertyStr(ctx, argv[2], "pixels");
    if (JS_IsException(*pixels)) {
        JS_PopGCRef(ctx, &property_ref);
        JS_PopGCRef(ctx, &pixels_ref);
        return JS_EXCEPTION;
    }
    color = buffer->foreground;
    background = buffer->background;
    if (argc >= 4 && !JS_IsUndefined(argv[3]) && !JS_IsNull(argv[3])) {
        if (JS_GetClassID(ctx, argv[3]) < 0) {
            JS_PopGCRef(ctx, &property_ref);
            JS_PopGCRef(ctx, &pixels_ref);
            return JS_ThrowTypeError(ctx, "Bitmap.drawMask() options must be an object");
        }
        *property = JS_GetPropertyStr(ctx, argv[3], "color");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            JS_PopGCRef(ctx, &pixels_ref);
            return JS_EXCEPTION;
        }
        color = normalize_color(ctx, buffer->format, *property, buffer->foreground, &ok);
        if (!ok) {
            JS_PopGCRef(ctx, &property_ref);
            JS_PopGCRef(ctx, &pixels_ref);
            return JS_ThrowTypeError(ctx, "Bitmap.drawMask() option 'color' must be valid");
        }
        *property = JS_GetPropertyStr(ctx, argv[3], "background");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            JS_PopGCRef(ctx, &pixels_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) && !JS_IsNull(*property)) {
            background = normalize_color(ctx, buffer->format, *property, buffer->background, &ok);
            if (!ok) {
                JS_PopGCRef(ctx, &property_ref);
                JS_PopGCRef(ctx, &pixels_ref);
                return JS_ThrowTypeError(ctx, "Bitmap.drawMask() option 'background' must be valid or null");
            }
            has_background = true;
        }
    }
    for (row = 0; row < height; ++row) {
        uint32_t col;

        for (col = 0; col < width; ++col) {
            uint32_t mask_pixel = 0;

            *property = JS_GetPropertyUint32(ctx, *pixels, index++);
            if (JS_IsException(*property)) {
                JS_PopGCRef(ctx, &property_ref);
                JS_PopGCRef(ctx, &pixels_ref);
                return JS_EXCEPTION;
            }
            if (!JS_IsUndefined(*property) && !JS_IsNull(*property) &&
                (!value_to_u32(ctx, *property, &mask_pixel) || mask_pixel != 0)) {
                set_pixel_raw(buffer, x + (int32_t)col, y + (int32_t)row, color);
            } else if (has_background) {
                set_pixel_raw(buffer, x + (int32_t)col, y + (int32_t)row, background);
            }
        }
    }
    JS_PopGCRef(ctx, &property_ref);
    JS_PopGCRef(ctx, &pixels_ref);
    mark_dirty(buffer, x, y, (int)width, (int)height);
    return *this_val;
}


#endif
